Tekla Open API Reference for Tekla Structures 2025
LoadLine.P2 Property
 The load magnitude vector at the end position. The values are given in the local coordinate system of the load (not in the current coordinate system).
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Vector P2 { get; set; }
Public Property P2 As Vector
	Get
	Set
Property Value
Type: Vector
See Also
Reference
LoadLine Class
Tekla.Structures.Model Namespace